cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'

brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'git-flow-avh'
brew 'jq'
brew 'libgit2'
# brew 'nvm'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'sshuttle'
brew 'unrar'
brew 'wget'
brew 'yarn'

cask '1password'
cask 'iterm2'
cask 'robomongo'
cask 'secure-pipes'
cask 'slack'
cask 'virtualbox'

# Java development
cask 'java'
brew 'maven'

# ide's and editors
cask 'atom'
cask 'brackets'
cask 'github-desktop'
cask 'intellij-idea-ce'
cask 'textmate'
cask 'visual-studio-code'

#browsers
cask 'firefox'
cask 'google-chrome-canary'
cask 'google-chrome'
cask 'multifirefox'
cask 'opera'
cask 'vivaldi'

# fonts
cask 'font-liberation-mono'
cask 'font-fira-code'

# spare time stuff
# cask 'boxer'
# cask 'minecraft'
# cask 'steam'
